# SweepTrajSegmented Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..SweepTrajSegmented Property
ParameterTypeId Class See Also
---
"Trajectory Segmentation"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId SweepTrajSegmented { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property SweepTrajSegmented As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ SweepTrajSegmented {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace